{"generatedBy": "keras v2.2.4", "modelTopology": {"model_config": {"config": {"name": "sequential_3", "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 160], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "dense_7", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 512}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_8", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 1024}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "activation": "sigmoid", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_9", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 784}, "class_name": "Dense"}]}, "class_name": "Sequential"}, "backend": "tensorflow", "keras_version": "2.2.4"}, "weightsManifest": [{"weights": [{"dtype": "float32", "name": "dense_7/kernel", "shape": [160, 512]}, {"dtype": "float32", "name": "dense_7/bias", "shape": [512]}, {"dtype": "float32", "name": "dense_8/kernel", "shape": [512, 1024]}, {"dtype": "float32", "name": "dense_8/bias", "shape": [1024]}, {"dtype": "float32", "name": "dense_9/kernel", "shape": [1024, 784]}, {"dtype": "float32", "name": "dense_9/bias", "shape": [784]}], "paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"]}], "convertedBy": "TensorFlow.js Converter v1.0.1", "format": "layers-model"}